import Header from "../Header/Header";
import Construction from "./Construction";
import Details from "./Deatils";
import InformBlock from "./NavBlock";
// import PageOne from "./PageOne";

import cube from '../../assets/img/image 2.png';
import focuswall from '../../assets/img/image 3.png';
import cubeImg from '../../assets/img/Монтажна область 1 1.png';
import winders from '../../assets/img/image 5.png'
import SizeDescription from "./WindersSize";
import ImageSlider from "./Slider";
import Contacts from "./Contacts";
import Footer from "../Footer/Footer";


const HomePage = () => {
    const focusWallData = [
        { header: "Алюмінієва рама", text: "Рами виготовлені з      високоякісного легкого алюмінію,  є довговічними,      а також й естетично привабливі. Легкість рами сприяє простоті монтажу та транспортування, а також дозволяє легко оновлювати текстильні постери, що ідеально підходить для частих маркетингових кампаній." },
        { header: "Текстильний постер", text: "Виготовлені з екологічно чистих матеріалів, тканинні постери характеризуються високою якістю зображення та відсутністю неприємних запахів, що робить їх ідеальними для внутрішнього використання. Зображення на текстилі виглядає яскраво, природно та реалістично." },
        { header: "LED-освітлення", text: "Новітні технології      світлодіодного освітлення забезпечують рівномірне світло, що підкреслює      якість зображення і зменшує енергоспоживання." },
    ];

    const cubeData = [
        { header: "Наповнення", text: "Брендовані м’які куби виготовленні з щільного поролоному. Що є безпечним для дітей та дозволяє створювати велике рекламне поле за допомогу виставлення кубів один на одного." },
        { header: "Зовнішні чохли", text: "Виготовленні з тканини Оксфорд, котра відштовхує воду та не вимагає особливого догляду." },
        { header: "Брендування", text: "На рекламному кубі можна розміщувати будь-яке повноколірне зображення на усіх 6-ти гранях, що надає максимальної видимості та ефективності реклами для вашої компанії чи продукту." },
    ]

    return (
        <div className="min-h-screen">
            <Header />
            <InformBlock />
            <Construction title="Конструкція Focus Wall" columns={focusWallData} image={focuswall} />
            <Details
                title="02.Куби"
                subtitle="Куби"
                description=" це є стильний і функціональний акцент для будь-якого заходу, який привертає увагу та запам’ятовується. Сидіння-куби легко адаптується до будь-якого простору і миттєво привертає увагу. Запорукою універсальності та зручності рекламного пуфа - є легкість та мобільність. Максимальна універсальність і зручність завдяки легкості та мобільності рекламного пуфа. Пуфи Cube створені для довготривалого використання з можливістю легкої заміни чохла. Використовуйте всю поверхню сидінь та втілюйте в життя свої креативні ідеї."
                buttonLabel="ЗАМОВИТИ"
                imageSrc={cube}
            />
            <Construction title="Конструкція Куба" columns={cubeData} image={cubeImg} />
            <Details
                title="03.Віндер"
                subtitle="Віндери"
                description=" зручний спосіб реклами для привернення уваги ваших клієнтів до бренду та подій.
Це мобільні рекламні конструкції у вигляді прапорів на стійкому флагштоку. Вони відрізняються легкістю та зручністю у використанні."
                buttonLabel="ЗАМОВИТИ"
                imageSrc={winders}
            />
            <SizeDescription />
            <ImageSlider />
            <Contacts />
            <Footer />
        </div>
    )
}

export default HomePage;